src/toir_cfe/src/Documents/проф_ЗаказНаПеремещение/проф_ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6d176df8-68cb-4f19-bbac-bbd7703c2c98">
  <name>проф_ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6c5a2bf9-d2aa-47e8-8705-6694bb13f700">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9721a458-7ec1-44ec-b1af-2b95e3a8f96b">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e16088c3-7946-48c6-b8f1-834edcf811f9">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f1feb67-7ecb-4ca1-a7ed-bd5a21a1e55f">
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a3eb8ed-6505-4b50-a4a8-5c417d8155fd">
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dee0b4b7-6273-4197-8770-a6fd0a284944">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="802fc0c1-1d67-46b2-b600-20fd67929d69">
    <name>МаксимальныйКодСтроки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fe487b2-2316-49ec-9feb-962a7e047234">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e73a67b0-2dd9-4207-b564-102ae95fa235">
    <name>НазначениеИсходное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7a1cafeb-fbf9-4c85-8a92-639d81876de2">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="638c5eb2-28f6-4e8c-8256-18545853e218">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5e6ad81e-c158-45e1-b2c4-150f6e93ad45">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55d934b3-78a3-44db-a79c-9bd1a458407d">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ba9f6e5-e9ce-4ddc-bac2-38b3198f0154">
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7cb73df8-dd58-4cb2-8829-aa6b5946a811">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b89ac4b9-aad4-442d-aad4-9ec9e2561e60">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c858b012-0671-4314-992f-cba64c579dd3">
    <name>СтатусСогласованияЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22b05a24-50ae-4294-91fc-f1acdf0e92bb">
    <name>торо_IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0734cf74-4ced-4a5d-a431-b1a5e3c69771">
    <name>торо_ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="72220f49-3577-4831-855b-459df2fcb09c">
    <name>торо_СозданПоПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d6f212f0-6417-4b99-aca2-7b8ca7faa450">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9c485d5b-b30d-4a52-ad19-a6c9f54b1f4a">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c8a6a1e-19df-4b95-a737-3f063f5ebd2c">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fdaba214-9037-48dd-a0eb-c0094d26c186">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="332d8232-8607-4b2a-9dda-ab29ff17a347">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4124bbfc-5dd6-421d-9aea-64892a2a14d4">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd73183c-12b8-47c1-aa41-5a5da0a13446">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ae21b88d-d09e-4332-9f7d-1a922d046cfa">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="200dffe7-979b-48e8-83b3-878b24cc4b3c">
      <name>Доступно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="435a0603-32c2-440e-bf7f-41971b029775">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cedbcd25-052b-4e57-9ffa-720ed25cfe45">
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4b9eaa58-e03a-4ef7-b478-090673f0bbe1">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6312e8e6-a80c-466a-a193-8855e54441b6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c192348f-8f44-4fa3-b558-83c2ea72d129">
      <name>НазначениеИсходное</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3e80edae-4125-4ec6-b4f2-81bef4580370">
      <name>СогласованиеКорректировки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8db1f0d2-ece7-4d77-9d72-a1e7cd68795f">
      <name>ТекстОшибки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60b619ed-751e-42e9-9466-5dc0c6505920">
      <name>Отменил</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/проф_ЗапасыИПотребности/проф_ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0c3966d-a188-422d-ae41-58971b18740e">
  <name>проф_ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="a09d559f-5429-40de-881e-a7a7455b0805">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3eba9edd-c306-45b3-adbf-0b6bd792797b">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3ff46c0a-d6a1-44d9-93cd-bd1c74e17152">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="796c95c7-1cc0-402b-a66a-b61c30c88768">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8d117610-557c-447a-826b-0939b2755cf2">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce740e0e-f426-41c7-a111-3357412b36f3">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c2c3b72e-9d8c-413c-a97a-18ce1c487b01">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c65a1e77-9998-4c19-8ead-3d53094b11d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f3780b58-1e35-42a5-ae55-269d2c78e18b">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bb4e1824-62e1-414d-8f98-544e41852af9">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="b13a9fdf-bf1e-4886-8c71-f4facd56f75f">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="490da68d-96cb-4e58-bbe6-b68b05d368f7">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b8faf3e1-e88d-430a-9d3b-8fcdf9a97ee7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="904aec5b-9e35-480e-867f-ca8b2baae6d1">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0ad62bbb-21aa-4934-a430-a1bd6aa95383">
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/Documents/проф_ЗаказНаПеремещение/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс	

//++ Проф-ИТ, #338, Корнилов М.С., 04.11.2023

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ИменаОбъектовМетаданных = РегистрыСведений.торо_ВводНаОсновании.ИменаДоступныхОбъектовМетаданныхДляВводаНаОсновании(
		 Метаданные.Документы.проф_ЗаказНаПеремещение.Имя);
		 
	Для Каждого ИмяОбъектаМетаданных Из ИменаОбъектовМетаданных Цикл
		Документы[ИмяОбъектаМетаданных].ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);		 
	КонецЦикла;		 
		
	торо_СозданиеНаОсновании.ДобавитьКомандуСоздатьНаОснованииБизнесПроцессЗадание(КомандыСозданияНаОсновании);
		
КонецПроцедуры

// Добавляет команду создания документа "Заказ на перемещение (Проф-ИТ)".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.проф_ЗаказНаПеремещение) Тогда
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.проф_ЗаказНаПеремещение.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.проф_ЗаказНаПеремещение);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
        Возврат КомандаСоздатьНаОсновании;
	КонецЕсли; 
	
    Возврат Неопределено;
	
КонецФункции

//-- Проф-ИТ, #338, Корнилов М.С., 04.11.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// ++ Проф-ИТ, #72, Соловьев А.А., 19.09.2023

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапроспроф_ЗаказыНаПеремещение(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Функция ТекстЗапроспроф_ЗаказыНаПеремещение(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "проф_ЗаказыНаПеремещение";
	
	Если НЕ ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	проф_ЗаказНаПеремещение.Ссылка КАК ЗаказНаПеремещение,
	|	проф_ЗаказНаПеремещение.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	проф_ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
	|	проф_ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
	|	проф_ЗаказНаПеремещениеТовары.Серия КАК Серия,
	|	проф_ЗаказНаПеремещениеТовары.КодСтроки КАК КодСтроки,
	|	проф_ЗаказНаПеремещениеТовары.Количество КАК КОформлению
	|ИЗ
	|	Документ.проф_ЗаказНаПеремещение КАК проф_ЗаказНаПеремещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.проф_ЗаказНаПеремещение.Товары КАК проф_ЗаказНаПеремещениеТовары
	|		ПО проф_ЗаказНаПеремещениеТовары.Ссылка = проф_ЗаказНаПеремещение.Ссылка
	|ГДЕ
	|	проф_ЗаказНаПеремещение.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры)

	Если ЗначениеЗаполнено(Регистры) Тогда
		
		Если ТипЗнч(Регистры) = Тип("Строка") Тогда
			МассивРегистров = Новый Структура(Регистры);
		Иначе
			МассивРегистров = Регистры;
		КонецЕсли;
		
		Если НЕ МассивРегистров.Свойство(ИмяРегистра) Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Истина;

КонецФункции

// -- Проф-ИТ, #72, Соловьев А.А., 19.09.2023

#КонецОбласти

#Область Печать

//++ Проф-ИТ, #370, Соловьев А.А., 28.11.2023

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.проф_ЗаказНаПеремещение";
	КомандаПечати.Идентификатор = "проф_ЗаказНаПеремещение";
	КомандаПечати.Представление = НСтр("ru = 'Заказ на перемещение'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР", "ПечатьДокументовБезПредварительногоПросмотра", Ложь);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "проф_ЗаказНаПеремещение") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"проф_ЗаказНаПеремещение", 
			"Заказ на перемещение", 
			проф_ПечатьЗаказНаПеремещение(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.проф_ЗаказНаПеремещение.ПФ_MXL_ЗаказНаПеремещение");
	КонецЕсли;
	
КонецПроцедуры 

 Функция проф_ПечатьЗаказНаПеремещение(МассивОбъектов, ОбъектыПечати) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	проф_ЗаказНаПеремещение.Ссылка КАК Ссылка,
	|	проф_ЗаказНаПеремещение.Номер КАК НомерДокумента,
	|	проф_ЗаказНаПеремещение.Дата КАК ДатаДокумента,
	|	СправочникСкладОтправитель.Представление КАК СкладОтправитель,
	|	СправочникСкладПолучатель.Представление КАК СкладПолучатель,
	|	Пользователи.Представление КАК Ответственный,
	|	Организации.Представление КАК Организация
	|ИЗ
	|	Документ.проф_ЗаказНаПеремещение КАК проф_ЗаказНаПеремещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО проф_ЗаказНаПеремещение.Организация = Организации.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СправочникСкладОтправитель
	|		ПО проф_ЗаказНаПеремещение.СкладОтправитель = СправочникСкладОтправитель.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СправочникСкладПолучатель
	|		ПО проф_ЗаказНаПеремещение.СкладПолучатель = СправочникСкладПолучатель.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО проф_ЗаказНаПеремещение.Ответственный = Пользователи.Ссылка
	|ГДЕ
	|	проф_ЗаказНаПеремещение.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ЗаказНаПеремещениеТовары.Ссылка КАК Ссылка,
	|	проф_ЗаказНаПеремещениеТовары.НомерСтроки КАК НомерСтроки,
	|	СправочникНоменклатура.НаименованиеПолное КАК Номенклатура,
	|	СправочникНоменклатура.Артикул КАК Артикул,
	|	проф_ЗаказНаПеремещениеТовары.Количество КАК Количество,
	|	проф_ЗаказНаПеремещениеТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА проф_ЗаказНаПеремещениеТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА СправочникНоменклатура.ЕдиницаИзмерения.Наименование
	|		ИНАЧЕ ЕдиницыИзмерения.Наименование
	|	КОНЕЦ КАК ЕдИзм,
	|	СправочникНоменклатура.ЕдиницаИзмерения.Наименование КАК БазоваяЕдИзм
	|ИЗ
	|	Документ.проф_ЗаказНаПеремещение.Товары КАК проф_ЗаказНаПеремещениеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО проф_ЗаказНаПеремещениеТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО УпаковкиНоменклатуры.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ПО проф_ЗаказНаПеремещениеТовары.Упаковка = УпаковкиНоменклатуры.Ссылка
	|ГДЕ
	|	проф_ЗаказНаПеремещениеТовары.Ссылка В(&МассивСсылок)";
	
	МакетПечати = ПолучитьМакет("ПФ_MXL_ЗаказНаПеремещение");
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_проф_ЗаказНаПеремещение";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаПоДокументам = МассивРезультатов[0].Выбрать();
	ВыборкаТовары 		= МассивРезультатов[1].Выбрать();
	
	ОбластьЗаголовок	= МакетПечати.ПолучитьОбласть("Заголовок");
	ОбластьШапка 		= МакетПечати.ПолучитьОбласть("Шапка");
	ОбластьСтрока		= МакетПечати.ПолучитьОбласть("Строка");
	ОбластьПодвал		= МакетПечати.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоДокументам.НомерДокумента, Истина, Истина);
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаПоДокументам);
		ОбластьЗаголовок.Параметры.НомерДокумента = НомерДокумента;
		ОбластьЗаголовок.Параметры.ДатаДокумента = Формат(ВыборкаПоДокументам.ДатаДокумента, "ДЛФ=Д");
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы + 2;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Пока ВыборкаТовары.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка)) Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТовары);
			Если ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал) Тогда
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			Иначе
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла;
		
		ВыборкаТовары.Сбросить();
		
		ОбластьПодвал.Параметры.Заполнить(ВыборкаПоДокументам);
		
		Если ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал) Тогда
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//-- Проф-ИТ, #370, Соловьев А.А., 28.11.2023

#КонецОбласти

// ++ Проф-ИТ, #72, Соловьев А.А., 19.09.2023

Функция ТаблицаДоступнойНоменклатурыПоНазначениям(ТаблицаТовары, Дата, ПодразделенияСлужбыТОиР) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Склад КАК Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ТаблицаТовары.Доступно КАК Доступно
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|	проф_ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|	проф_ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
	|	СУММА(проф_ЗапасыИПотребностиОстатки.ВНаличииОстаток - проф_ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток - проф_ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток) КАК ВНаличииОстаток
	|ПОМЕСТИТЬ втЗапасыИПотребности
	|ИЗ
	|	РегистрНакопления.проф_ЗапасыИПотребности.Остатки(
	|			&Дата,
	|			(Номенклатура, Характеристика, Склад) В
	|				(ВЫБРАТЬ
	|					втТовары.Номенклатура КАК Номенклатура,
	|					втТовары.Характеристика КАК Характеристика,
	|					втТовары.Склад КАК Склад
	|				ИЗ
	|					втТовары КАК втТовары)) КАК проф_ЗапасыИПотребностиОстатки
	|ГДЕ
	|	проф_ЗапасыИПотребностиОстатки.ВНаличииОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	проф_ЗапасыИПотребностиОстатки.Номенклатура,
	|	проф_ЗапасыИПотребностиОстатки.Характеристика,
	|	проф_ЗапасыИПотребностиОстатки.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗапасыИПотребности.Номенклатура КАК Номенклатура,
	|	втЗапасыИПотребности.Характеристика КАК Характеристика,
	|	втЗапасыИПотребности.Назначение КАК Назначение,
	|	СУММА(втЗапасыИПотребности.ВНаличииОстаток) КАК Доступно
	|ПОМЕСТИТЬ втОбщая
	|ИЗ
	|	втЗапасыИПотребности КАК втЗапасыИПотребности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_Назначения КАК проф_Назначения
	|		ПО втЗапасыИПотребности.Назначение = проф_Назначения.Ссылка
	|			И (проф_Назначения.Подразделение В (&ПодразделенияСлужбыТОиР))
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗапасыИПотребности.Характеристика,
	|	втЗапасыИПотребности.Назначение,
	|	втЗапасыИПотребности.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втЗапасыИПотребности.Номенклатура,
	|	втЗапасыИПотребности.Характеристика,
	|	втЗапасыИПотребности.Назначение,
	|	СУММА(втЗапасыИПотребности.ВНаличииОстаток)
	|ИЗ
	|	втЗапасыИПотребности КАК втЗапасыИПотребности
	|ГДЕ
	|	втЗапасыИПотребности.Назначение = ЗНАЧЕНИЕ(Справочник.проф_Назначения.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗапасыИПотребности.Номенклатура,
	|	втЗапасыИПотребности.Назначение,
	|	втЗапасыИПотребности.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбщая.Номенклатура КАК Номенклатура,
	|	втОбщая.Характеристика КАК Характеристика,
	|	втОбщая.Назначение КАК Назначение,
	|	СУММА(втОбщая.Доступно) - СУММА(ЕСТЬNULL(втТовары.Доступно, 0)) КАК Доступно
	|ПОМЕСТИТЬ втИтоговая
	|ИЗ
	|	втОбщая КАК втОбщая
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТовары КАК втТовары
	|		ПО втОбщая.Номенклатура = втТовары.Номенклатура
	|			И втОбщая.Характеристика = втТовары.Характеристика
	|			И втОбщая.Назначение = втТовары.Назначение
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбщая.Характеристика,
	|	втОбщая.Назначение,
	|	втОбщая.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗапасыИПотребности.Номенклатура КАК Номенклатура,
	|	втЗапасыИПотребности.Характеристика КАК Характеристика,
	|	СУММА(втЗапасыИПотребности.ВНаличииОстаток) КАК РезервНеТОиР
	|ПОМЕСТИТЬ втРезервНеТОиР
	|ИЗ
	|	втЗапасыИПотребности КАК втЗапасыИПотребности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_Назначения КАК проф_Назначения
	|		ПО втЗапасыИПотребности.Назначение = проф_Назначения.Ссылка
	|			И (НЕ проф_Назначения.Подразделение В (&ПодразделенияСлужбыТОИР))
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗапасыИПотребности.Характеристика,
	|	втЗапасыИПотребности.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтоговая.Номенклатура КАК Номенклатура,
	|	втИтоговая.Характеристика КАК Характеристика,
	|	втИтоговая.Назначение КАК Назначение,
	|	втИтоговая.Доступно КАК Доступно,
	|	0 КАК РезервНеТОиР
	|ИЗ
	|	втИтоговая КАК втИтоговая
	|ГДЕ
	|	втИтоговая.Доступно > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втРезервНеТОиР.Номенклатура,
	|	втРезервНеТОиР.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.проф_Назначения.ПустаяСсылка),
	|	0,
	|	втРезервНеТОиР.РезервНеТОиР
	|ИЗ
	|	втРезервНеТОиР КАК втРезервНеТОиР
	|ГДЕ
	|	втРезервНеТОиР.РезервНеТОиР > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Доступно УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	Запрос.УстановитьПараметр("ПодразделенияСлужбыТОиР", ПодразделенияСлужбыТОиР);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПерезаполнитьДоступностьИНазначения(Товары,
											  ПоОтклоненным,
											  Склад,
											  Дата,
											  ПодразделенияСлужбыТОиР) Экспорт
	
	СтрСклад = "Склад";
	
	Если ПоОтклоненным Тогда 
		СтруктураПоиска = Новый Структура("СогласованиеКорректировки", Перечисления.проф_СогласованиеКорректировки.Отклонен);
	Иначе
		СтруктураПоиска = Новый Структура("Доступно", 0);
	КонецЕсли;
	
	СтрокиТЧ = Товары.НайтиСтроки(СтруктураПоиска);
	Если СтрокиТЧ.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаТовары = Товары.Выгрузить(, "Номенклатура, Характеристика, Назначение, СогласованиеКорректировки, Доступно");
	
	ОбнулитьДоступностьПоСтруктуреПоиска(ПоОтклоненным, ТаблицаТовары, СтруктураПоиска);
		
	ТаблицаТовары.Свернуть("Номенклатура, Характеристика, Назначение", "Доступно");
	ТаблицаТовары.Колонки.Добавить(СтрСклад, Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаТовары.ЗаполнитьЗначения(Склад, СтрСклад);
	
	ДатаОстатков = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	ТаблицаДоступнойНоменклатурыПоНазначениям = ТаблицаДоступнойНоменклатурыПоНазначениям(
		ТаблицаТовары, ДатаОстатков, ПодразделенияСлужбыТОиР);
	
	Если ТаблицаДоступнойНоменклатурыПоНазначениям.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не найдены остатки по складу %1'"), Склад);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	проф_ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
	|	проф_ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
	|	проф_ЗаказНаПеремещениеТовары.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ втИтоговая
	|ИЗ
	|	&Товары КАК проф_ЗаказНаПеремещениеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтоговая.Номенклатура КАК Номенклатура,
	|	втИтоговая.Характеристика КАК Характеристика,
	|	втИтоговая.Упаковка КАК Упаковка,
	|	Склады.Представление КАК СкладПредставление,
	|	СправочникНоменклатура.Представление КАК НоменклатураПредставление,
	|	ВЫБОР
	|		КОГДА втИтоговая.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЕдиницыИзмерения.Представление
	|		ИНАЧЕ УпаковкиНоменклатуры.Представление
	|	КОНЕЦ КАК УпаковкаПредставление,
	|	ХарактеристикиНоменклатуры.Представление КАК ХарактеристикаПредставление
	|ИЗ
	|	втИтоговая КАК втИтоговая
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО СправочникНоменклатура.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ПО втИтоговая.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО втИтоговая.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО втИтоговая.Упаковка = УпаковкиНоменклатуры.Ссылка,
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &Склад";
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
	Запрос.УстановитьПараметр(СтрСклад, Склад);
	
	ТаблицаПредставлений = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТовары Из СтрокиТЧ Цикл
		
		СтрокаТовары.Доступно = 0;
		Если ЗначениеЗаполнено(СтрокаТовары.НазначениеИсходное) Тогда 
			СтрокаТовары.Доступно = СтрокаТовары.КоличествоУпаковок;
			Если Не ЗначениеЗаполнено(СтрокаТовары.Назначение) Тогда 
				СтрокаТовары.Назначение = СтрокаТовары.НазначениеИсходное;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
		СтрокиПоНазначениям = ТаблицаДоступнойНоменклатурыПоНазначениям.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиПоНазначениям.Количество() = 0 Тогда 
			СообщитьОНехватке(СтрокаТовары, ТаблицаПредставлений, СтрокаТовары.КоличествоУпаковок);
			Товары.Удалить(СтрокаТовары);
			Возврат;
		КонецЕсли;
		
		Результат = ПерезаполнитьДоступностьИНазначенияСтрокПоНазначениям(СтрокаТовары,
																		  СтрокиПоНазначениям,
																		  Товары,
																		  ТаблицаПредставлений);
		Если Не Результат Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПерезаполнитьДоступностьИНазначенияСтрокПоНазначениям(СтрокаТовары,
																СтрокиПоНазначениям,
																Товары,
																ТаблицаПредставлений)
	
	ИндексСтроки = 0;
	Для Каждого СтрокаПоНазначению Из СтрокиПоНазначениям Цикл
		
		Если СтрокаПоНазначению.Доступно = 0
			И СтрокаПоНазначению.РезервНеТОиР = 0 Тогда
			
			СообщитьОНехватке(СтрокаТовары, ТаблицаПредставлений, СтрокаТовары.КоличествоУпаковок);
			Товары.Удалить(СтрокаТовары);
			Возврат Ложь;
			
		КонецЕсли;
		
		Если СтрокаТовары.КоличествоУпаковок <= СтрокаПоНазначению.Доступно Тогда
			
			СтрокаТовары.Доступно 					= СтрокаТовары.КоличествоУпаковок;
			//++ Проф-ИТ, #372, Соловьев А.А., 29.11.2023
			Если Не ЗначениеЗаполнено(СтрокаТовары.Назначение) Тогда 
				СтрокаТовары.Назначение 			= СтрокаПоНазначению.Назначение;
			КонецЕсли;
			//-- Проф-ИТ, #372, Соловьев А.А., 29.11.2023
			СтрокаТовары.НазначениеИсходное			= СтрокаПоНазначению.Назначение;
			СтрокаТовары.СогласованиеКорректировки	= Перечисления.проф_СогласованиеКорректировки.НеТребуется;
			СтрокаПоНазначению.Доступно				= СтрокаПоНазначению.Доступно - СтрокаТовары.КоличествоУпаковок;
			
			Продолжить;
		КонецЕсли;
		
		Если СтрокаПоНазначению.Доступно > 0 Тогда
			
			НоваяСтрока = Товары.Вставить(СтрокаТовары.НомерСтроки + ИндексСтроки);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
			НоваяСтрока.КоличествоУпаковок	= СтрокаПоНазначению.Доступно;
			НоваяСтрока.Количество			= СтрокаПоНазначению.Доступно;
			НоваяСтрока.Доступно			= СтрокаПоНазначению.Доступно;
			//++ Проф-ИТ, #372, Соловьев А.А., 29.11.2023
			Если Не ЗначениеЗаполнено(НоваяСтрока.Назначение) Тогда 
				НоваяСтрока.Назначение		= СтрокаПоНазначению.Назначение;
			КонецЕсли;
			//-- Проф-ИТ, #372, Соловьев А.А., 29.11.2023
			НоваяСтрока.НазначениеИсходное	= СтрокаПоНазначению.Назначение;
			НоваяСтрока.СогласованиеКорректировки = Перечисления.проф_СогласованиеКорректировки.НеТребуется;
			
			СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок - СтрокаПоНазначению.Доступно;
			СтрокаТовары.Количество = СтрокаТовары.КоличествоУпаковок;
			СтрокаПоНазначению.Доступно = 0;
			
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
		
		ПоследняяСтрока = (ИндексСтроки = СтрокиПоНазначениям.Количество());
		Если Не ПоследняяСтрока Тогда 
			Продолжить;
		КонецЕсли;
		
		Если СтрокаПоНазначению.РезервНеТОиР < СтрокаТовары.КоличествоУпаковок Тогда 
			СообщитьОНехватке(СтрокаТовары, ТаблицаПредставлений, 
				СтрокаТовары.КоличествоУпаковок - СтрокаПоНазначению.РезервНеТОиР);
		КонецЕсли;
		
		Доступно = Мин(СтрокаТовары.КоличествоУпаковок, СтрокаПоНазначению.РезервНеТОиР);
		
		СтрокаТовары.КоличествоУпаковок = Доступно;
		СтрокаТовары.Количество 		= Доступно;
		
		СтрокаПоНазначению.РезервНеТОиР = СтрокаПоНазначению.РезервНеТОиР - Доступно;
		
		Если СтрокаТовары.Количество = 0 Тогда 
			Товары.Удалить(СтрокаТовары);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбнулитьДоступностьПоСтруктуреПоиска(ПоОтклоненным, ТаблицаТовары, СтруктураПоиска)
	
	Если Не ПоОтклоненным Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокиТовары = ТаблицаТовары.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаТовары Из СтрокиТовары Цикл
		СтрокаТовары.Доступно = 0;
	КонецЦикла;
	
КонецПроцедуры

Процедура СообщитьОНехватке(СтрокаТовары, ТаблицаПредставлений, Количество)
	
	СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, Упаковка");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
	СтрокиПредставлений = ТаблицаПредставлений.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТаблицаПредставлений Из СтрокиПредставлений Цикл
		
		ТекстСообщения = НСтр("ru = 'Невозможно добавить %1 %2 по %3. Нет доступного количества на %4'");
		Если Не ПустаяСтрока(СтрокаТаблицаПредставлений.ХарактеристикаПредставление) Тогда 
			Номенклатура = СтрокаТаблицаПредставлений.НоменклатураПредставление + " " + СтрокаТаблицаПредставлений.ХарактеристикаПредставление;
		Иначе
			Номенклатура = СтрокаТаблицаПредставлений.НоменклатураПредставление;
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(ТекстСообщения, 
			Количество, 
			СтрокаТаблицаПредставлений.УпаковкаПредставление, 
			Номенклатура,
			СтрокаТаблицаПредставлений.СкладПредставление);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЦикла;
	
КонецПроцедуры	

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// -- Проф-ИТ, #72, Соловьев А.А., 19.09.2023
#КонецОбласти

#КонецЕсли
